import json

import pandas as pd
import pytest


@pytest.fixture
def sample_df():
    """Фикстура с тестовым датафреймом транзакций"""
    data = {
        "Дата операции": ["2025-01-20 15:12:00", "2025-01-21 10:00:00", "2025-01-22 20:30:00"],
        "Номер карты": ["*1234", "*5678", "*1234"],
        "Сумма платежа": [1000, 2000, 500],
        "Категория": ["Супермаркеты", "Такси", "Супермаркеты"],
        "Описание": ["Покупка продуктов", "Поездка на такси", "Молоко и хлеб"],
    }
    df = pd.DataFrame(data)
    df["Дата операции"] = pd.to_datetime(df["Дата операции"], format="%Y-%m-%d %H:%M:%S")
    return df


@pytest.fixture
def sample_settings(tmp_path):
    settings = {"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]}
    f = tmp_path / "user_settings.json"
    f.write_text(json.dumps(settings))
    return f


@pytest.fixture
def sample_transactions():
    """Фикстура для тестового DataFrame с транзакциями."""
    data = [
        {"Дата операции": "01.11.2025 10:00:00", "Сумма платежа": 100},
        {"Дата операции": "02.11.2025 12:00:00", "Сумма платежа": 200},
        {"Дата операции": "07.11.2025 15:00:00", "Сумма платежа": 300},  # суббота
        {"Дата операции": "08.11.2025 16:00:00", "Сумма платежа": 400},  # воскресенье
        {"Дата операции": "03.11.2025 11:00:00", "Сумма платежа": 150},
    ]
    df = pd.DataFrame(data)
    return df


@pytest.fixture
def sample_transactions_1():
    return pd.DataFrame(
        [
            {"Дата операции": "15.12.2021 10:00:00", "Категория": "Ж/д билеты", "Кэшбэк": 100},
            {"Дата операции": "20.12.2021 12:00:00", "Категория": "Ж/д билеты", "Кэшбэк": 81},
            {"Дата операции": "05.11.2021 14:00:00", "Категория": "Такси", "Кэшбэк": 50},
            {"Дата операции": "25.12.2021 09:00:00", "Категория": "Развлечения", "Кэшбэк": 0},
        ]
    )


@pytest.fixture
def empty_transactions():
    return pd.DataFrame(columns=["Дата операции", "Категория", "Кэшбэк"])


@pytest.fixture
def sample_data():
    return pd.DataFrame(
        {
            "Дата операции": ["01.12.2021 10:00:00", "05.12.2021 12:00:00", "10.12.2021 15:00:00"],
            "Категория": ["Ж/д билеты", "Развлечения", "Ж/д билеты"],
            "Кэшбэк": [100, 0, 81],
        }
    )
